README.org
#                            -*- mode: org; -*-
#
#+TITLE:     OpenFOAM README for version 2.0.x
#+AUTHOR:                      OpenCFD Ltd.
#+DATE:                     15th August 2011
#+LINK:                  http://www.openfoam.com
#+OPTIONS: author:nil ^:{}
# Copyright (c) 2011 OpenCFD Ltd.

* OpenFOAM is now released by the OpenFOAM Foundation
  On the 8th of August 2011 the copyright of OpenFOAM was transferred from and
  by OpenCFD Ltd. to the newly formed OpenFOAM Foundation.  The new location for
  the OpenFOAM-2.0.x repository is http://github.com/OpenFOAM/OpenFOAM-2.0.x

* Download and installation instructions
  + To install from the OpenFOAM Foundation Git repository, see
    [[http://www.OpenFOAM.org/git.php]]
  + If you wish to upgrade your existing OpenFOAM-2.0.x repository to the new
    version from the OpenFOAM Foundation, in the file
    - =OpenFOAM-2.0.x/.git/config=
    - change
    - =url = git://github.com/OpenCFD/OpenFOAM-2.0.x.git=
    - to
    - =url = git://github.com/OpenFOAM/OpenFOAM-2.0.x.git=
    - and then
    - =git pull=
