README.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>OpenFOAM README for version 2.0.x</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="15th August 2011"/>
<meta name="author" content="OpenCFD Ltd."/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="content">

<h1 class="title">OpenFOAM README for version 2.0.x</h1>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 OpenFOAM is now released by the OpenFOAM Foundation </a></li>
<li><a href="#sec-2">2 Download and installation instructions </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> OpenFOAM is now released by the OpenFOAM Foundation </h2>
<div class="outline-text-2" id="text-1">

<p>  On the 8th of August 2011 the copyright of OpenFOAM was transferred from and
  by OpenCFD Ltd. to the newly formed OpenFOAM Foundation.  The new location for
  the OpenFOAM-2.0.x repository is <a href="http://github.com/OpenFOAM/OpenFOAM-2.0.x">http://github.com/OpenFOAM/OpenFOAM-2.0.x</a>
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Download and installation instructions </h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>To install from the OpenFOAM Foundation Git repository, see
    <a href="http://www.OpenFOAM.org/git.php">http://www.OpenFOAM.org/git.php</a>
</li>
<li>If you wish to upgrade your existing OpenFOAM-2.0.x repository to the new
    version from the OpenFOAM Foundation, in the file
    <code>OpenFOAM-2.0.x/.git/config</code> change <br/>
    <code>url = git://github.com/OpenCFD/OpenFOAM-2.0.x.git</code> <br/>
    to <br/>
    <code>url = git://github.com/OpenFOAM/OpenFOAM-2.0.x.git</code> <br/>
    and then <br/>
    <code>git pull</code>
</li>
</ul>

</div>
</div>
<div id="postamble">
<p class="date">Date: 15th August 2011</p>
<p class="creator">Org version 7.5 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>
</div>
</div>
</body>
</html>
